test/load/get_api_strategies.yml
config:
  target: http://localhost:8080
  processor: "./processor.js"
  defaults:
    headers:
      Content-Type: application/json
  phases:
    - duration: 10
      arrivalRate: 5
      name: Warm up
    - duration: 30
      arrivalRate: 20
      rampTo: 50
      name: Sustained peak load
    - duration: 10
      arrivalRate: 5
      name: Ramp down

scenarios:
  - beforeScenario: "getStrategies"
    flow:
      - get:
          url: /api/strategies
          name: Get strategies
          headers:
            cf-connecting-ip: "{{ ip }}"